**Learnings for module Pandas**

In [3]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

# Set options for pandas for inline display

In [7]:
#Set number of columns to be shown
pd.set_option("display.max_columns", None) # No limit for columns displayed
pd.set_option("display.max_rows", 999) # No. of rows of a dataframe
pd.set_option("display.max_seq_items", 999) # No. of list items shown

In [ ]:
# Example to be prepared - can be used to filter for top and bottom 10 of a dataframe
top = 10
top_bottom = np.r_[0:top, -top:0]

dus_top_bottom = dus_data.sort_values(by='Movings', ascending=True).iloc[top_bottom]

# Importing Data

## CSV

In [4]:
# define format of date column
dateparser = lambda x: pd.datetime.strptime(x, "%d.%m.%Y")

# import data from csv, including parsing of date column
df_bookings_import = pd.read_csv('bookings.csv',
                                  sep=';',
                                  skiprows=1,
                                  encoding='utf-16',
                                  decimal=',',
                                  parse_dates=['Datum'],
                                  date_parser=dateparser
                                )
df_bookings_import.head()

,Datum,Typ,Betrag,Währung,Kategorie,Person,Konto,Gegenkonto,Gruppe,Notiz,Wiederholend,Unnamed: 11
0,2019-09-17,Ausgabe,-39.99,EUR,Kleidung,NaN,Girokonto,NaN,NaN,NaN,nein,NaN
1,2019-09-17,Ausgabe,-9.99,EUR,Bücher,NaN,Girokonto,NaN,NaN,NaN,nein,NaN
2,2019-09-17,Ausgabe,-13.05,EUR,Reisen,NaN,NaN,NaN,NaN,NaN,nein,NaN
3,2019-11-16,Ausgabe,-3.00,EUR,Bier,NaN,Girokonto,NaN,NaN,NaN,nein,NaN
4,2019-12-21,Ausgabe,-4.00,EUR,Geschenke,NaN,Bargeld,NaN,NaN,NaN,nein,NaN

In [6]:
columns_to_drop = ['Person',
                   'Gegenkonto',
                   'Gruppe',
                   'Unnamed: 11'
                  ]

df_bookings = (df_bookings_import.drop(columns_to_drop, axis=1) # drop columns as defined above
                                 .query("Typ != 'Umbuchung'") # do not include 'Umbuchungen' as they appear wrongfully as spend / earnings
                                 .query("Kategorie != 'Sparen' and \
                                         Kategorie != 'Test'") # To analyse monthly budget required, those need to be excluded
                                 .assign(Jahr=df_bookings_import['Datum'].map(lambda x: x.year))
                                 .assign(Monat=df_bookings_import['Datum'].map(lambda x: f'{x.month:02d}'))
                                 .assign(Tag=df_bookings_import['Datum'].map(lambda x: f'{x.day:02d}'))
                                 .assign(Jahr_Monat=df_bookings_import['Datum'].map(lambda x: f'{x.year}-{x.month:02d}'))
              )

df_bookings.head()

,Datum,Typ,Betrag,Währung,Kategorie,Konto,Notiz,Wiederholend,Jahr,Monat,Tag,Jahr_Monat
0,2019-09-17,Ausgabe,-39.99,EUR,Kleidung,Girokonto,NaN,nein,2019,09,17,2019-09
1,2019-09-17,Ausgabe,-9.99,EUR,Bücher,Girokonto,NaN,nein,2019,09,17,2019-09
2,2019-09-17,Ausgabe,-13.05,EUR,Reisen,NaN,NaN,nein,2019,09,17,2019-09
3,2019-11-16,Ausgabe,-3.00,EUR,Bier,Girokonto,NaN,nein,2019,11,16,2019-11
4,2019-12-21,Ausgabe,-4.00,EUR,Geschenke,Bargeld,NaN,nein,2019,12,21,2019-12

# Analyzing Data

## Data Types

Get the type of data of a column and transform it into another type.

In [3]:
df_t = pd.DataFrame({"A": [0,1], "B": [2,3]})
print(df_t.dtypes)
print("\n")
print(df_t.A.dtype)

df_t["A"] = df_t.A.astype(str)
print(df_t.A.dtype)

A    int64
B    int64
dtype: object


int64
object

Show all values and their counts in a specific column of the DataFrame and sort in descending order.

In [4]:
df_t.A.value_counts().sort_values(ascending=False)

1    1
0    1
Name: A, dtype: int64

## High-Level description and summary

In [6]:
df_unique_count = pd.DataFrame({"A": ["A","A","A","D","E"], "B": ["C","D","E","E","F"], "C":["G","C","F","B","E"], "D":[1,2,3,4,5]})
df_unique_count.describe()

              D
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [8]:
df_unique_count.describe(exclude="number")

        A  B  C
count   5  5  5
unique  3  4  5
top     A  E  F
freq    3  2  1

In [10]:
df_unique_count.describe(include="all")

          A    B    C         D
count     5    5    5  5.000000
unique    3    4    5       NaN
top       A    E    F       NaN
freq      3    2    1       NaN
mean    NaN  NaN  NaN  3.000000
std     NaN  NaN  NaN  1.581139
min     NaN  NaN  NaN  1.000000
25%     NaN  NaN  NaN  2.000000
50%     NaN  NaN  NaN  3.000000
75%     NaN  NaN  NaN  4.000000
max     NaN  NaN  NaN  5.000000

In [9]:
df_unique_count.describe(exclude='number')[:2].T.sort_values('unique')

  count unique
A     5      3
B     5      4
C     5      5

# Modifying shape and structure of DataFrame

## Rename columns

In [6]:
df_ren = pd.DataFrame({"A": [0,1], "B": [2,3]})
print(df_ren)
print("\n")

df_ren = df_ren.rename(columns={"A":"First", "B":"Second"})
print(df_ren)

   A  B
0  0  2
1  1  3


   First  Second
0      0       2
1      1       3

## Rename Label of index and columns axis

In [7]:
df_ren = df_ren.rename_axis("Ind", axis="rows").rename_axis("Cols", axis="columns")
df_ren

Cols  First  Second
Ind
0         0       2
1         1       3

## Casting data types to columns or index (e.g. as preparation for plotting)

In [15]:
df_ren.index.dtype

dtype('int64')

In [16]:
df_ren.index = map(str, df_ren.index)
df_ren.index.dtype

dtype('O')

## Pivoting DataFrames

No aggregation required

In [12]:
df_piv = pd.DataFrame([[0,2,3],[1,3,4],[3,1,2]], columns=["A", "B", "C"])
print(df_piv)
df_piv_p = df_piv.pivot(index="A", columns="B", values="C")
print("\n")
print(df_piv_p)

   A  B  C
0  0  2  3
1  1  3  4
2  3  1  2


B    1    2    3
A
0  NaN  3.0  NaN
1  NaN  NaN  4.0
3  2.0  NaN  NaN

Aggregation required, due to multiple combinations of new index with target columns

In [13]:
df_piv2 = pd.DataFrame([[0,2,3],[1,3,4],[0,1,2]], columns=["A", "B", "C"])
print(df_piv2)
df_piv2_p = df_piv2.pivot_table(index="A", columns="B", values="C", aggfunc=np.sum)
print("\n")
print(df_piv2_p)

   A  B  C
0  0  2  3
1  1  3  4
2  0  1  2


B    1    2    3
A
0  2.0  3.0  NaN
1  NaN  NaN  4.0

## Copying columns into new DataFrame

In [14]:
df_initial = pd.DataFrame({"A": [1,2,3,4], "B": [5,6,7,8], "C": [9,10,11,12]})
df_partial_copy = df_initial[["B"]] # df_partial_copy = df_initial["B"] creates a pd.Series object

print("Initial:\n")
print(df_initial)
print("\n")
print("Partial Copy:\n")
print(df_partial_copy)

Initial:

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12


Partial Copy:

   B
0  5
1  6
2  7
3  8

## Copying filtered rows to new DataFrame

In [33]:
df_filtered_row = df_initial[df_initial["B"]>6]
df_filtered_row

   A  B   C
2  3  7  11
3  4  8  12

# Working with the Data

## Maps and Apply

In [15]:
df_m = pd.DataFrame({"A": [0,1], "B": [2,3]})
df_m

   A  B
0  0  2
1  1  3

In [16]:
#Add 1 to values of column "B" and add as column "C"
df_m["C"] = df_m.B.map(lambda x: x + 1)
df_m

   A  B  C
0  0  2  3
1  1  3  4

## Appending data to DataFrame

Append one row with specific elements (including null value)

In [17]:
df_ap_in = pd.DataFrame({"A": [0,1], "B": [2,3], "C": [4,5]})
df_ap = df_ap_in.append({"A": np.nan, "B": 1, "C": np.nan}, ignore_index=True)
df_ap

     A    B    C
0  0.0  2.0  4.0
1  1.0  3.0  5.0
2  NaN  1.0  NaN

In [18]:
df_conc = pd.concat([df_ap, df_ap_in], sort=False)
df_conc

     A    B    C
0  0.0  2.0  4.0
1  1.0  3.0  5.0
2  NaN  1.0  NaN
0  0.0  2.0  4.0
1  1.0  3.0  5.0

## Replacing data in DataFrame

In [19]:
df_replace = pd.DataFrame({"A": ["Yes", "No"], "B": ["No", "Yes"]})
df_replace

     A    B
0  Yes   No
1   No  Yes

In [20]:
df_replace = df_replace.replace(to_replace="Yes", value=1)
df_replace = df_replace.replace(to_replace="No", value=0)
df_replace

   A  B
0  1  0
1  0  1

## Binning Data

In [3]:
df_binning = pd.DataFrame({"A": [1,2,3,4,5,6,7,8,9,10]})
df_binning

    A
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [6]:
bins = np.linspace(min(df_binning["A"]), max(df_binning["A"]),4)
group_names = ["Low","Medium","High"]
df_binning["binned"] = pd.cut(df_binning["A"],bins,labels=group_names,include_lowest=True)
print(bins)
print("\n")
print(df_binning)

[ 1.  4.  7. 10.]


    A  binned
0   1     Low
1   2     Low
2   3     Low
3   4     Low
4   5  Medium
5   6  Medium
6   7  Medium
7   8    High
8   9    High
9  10    High

## One Hot Encoding with Pandas

In [10]:
df_ohe = pd.DataFrame({"A": ["A","A","A","D","E"], "B": ["C","D","E","E","F"], "C":["G","C","F","B","E"], "D":[1,2,3,4,5]})
columns = ["A","B","C"]
for column in columns:
    df_ohe[column]= pd.get_dummies(df_ohe[column])
df_ohe

   A  B  C  D
0  1  1  0  1
1  1  0  0  2
2  1  0  0  3
3  0  0  1  4
4  0  0  0  5

# Coping with missing values (null, NaN)

## Analysing missing values

Function isnull() returns boolean value

In [21]:
df_n = pd.DataFrame({"A": [0,np.nan,3], "B": [2,3,1], "C": [np.nan,3,np.nan]})
df_n.isnull()

       A      B      C
0  False  False   True
1   True  False  False
2  False  False   True

Print all columns with the number of NaN values

In [22]:
df_n.isna().sum()

A    1
B    0
C    2
dtype: int64

Print only columns with NaN values - # of NaN values

In [23]:
null_count = (df_n.isnull().sum())
print(null_count[null_count > 0])

A    1
C    2
dtype: int64

Print only columns with NaN values - % of NaN values

In [24]:
missing = df_n.isna().mean()
missing[missing > 0].sort_values(ascending=False)

C    0.666667
A    0.333333
dtype: float64

In [25]:
df_n.loc[df_n.C.isna()]

     A  B   C
0  0.0  2 NaN
2  3.0  1 NaN

Create list of columns with missing values

In [26]:
list_of_cols = [col for col in df_n.columns
               if df_n[col].isnull().any()]

list_of_cols

['A', 'C']

## Fill missing values - manually

In [27]:
df_n_fill = df_n.copy()
df_n_fill["A"] = df_n_fill.A.fillna(0)
df_n_fill

     A  B    C
0  0.0  2  NaN
1  0.0  3  3.0
2  3.0  1  NaN

In [28]:
df_n_fill = df_n_fill.fillna(np.random.randint(0,3))
df_n_fill

     A  B    C
0  0.0  2  2.0
1  0.0  3  3.0
2  3.0  1  2.0

## Filling missing values - imputer

In [29]:
si = SimpleImputer()
df_n_si = pd.DataFrame(si.fit_transform(df_n))
df_n_si

     0    1    2
0  0.0  2.0  3.0
1  1.5  3.0  3.0
2  3.0  1.0  3.0

# Filtering

In [2]:
df_filter_query = pd.DataFrame({"A": ["A","A","A","D","E"], "B": ["C","D","E","E","F"], "C":["G","C","F","B","E"]})
df_filter_query

   A  B  C
0  A  C  G
1  A  D  C
2  A  E  F
3  D  E  B
4  E  F  E

In [6]:
(df_filter_query.query("A == 'A'")
                .query("B == 'D'")
)

   A  B  C
1  A  D  C

In [17]:
df_filter_query[(df_filter_query["A"] == "A") & (df_filter_query["B"] == "D")]

   A  B  C
1  A  D  C